kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
#include "stdint.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "esp_log.h"

#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
#if CONFIG_SOFTWARE_ESP_MQTT_SUPPORT
#include "mqtt_client.h"
#include "lwip/sockets.h"
#include "lwip/dns.h"
#include "lwip/netdb.h"
#endif //CONFIG_SOFTWARE_ESP_MQTT_SUPPORT
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#include "driver/gpio.h"
#include "esp_sntp.h"
#include "esp_intr_alloc.h"
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

#if CONFIG_SOFTWARE_SERIAL_TXRX_SUPPORT
#include "esp_system.h"
#include "esp_log.h"
#include "driver/uart.h"
#include "string.h"
#include "driver/gpio.h"
#endif //CONFIG_SOFTWARE_SERIAL_TXRX_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
#include "driver/i2c_master.h"
#endif //CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT

#if CONFIG_DEEP_SLEEP_SUPPORT
#include <stdio.h>
#include <time.h>
#include <sys/time.h>
#include "esp_sleep.h"
#include "esp_log.h"
#include "driver/rtc_io.h"
#include "nvs_flash.h"
#include "nvs.h"
#endif //CONFIG_DEEP_SLEEP_SUPPORT

#if CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#endif //CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT

#if (  CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT \
    || CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT \
    || CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT \
    || CONFIG_SOFTWARE_SENSOR_SHT3X \
    || CONFIG_SOFTWARE_SENSOR_SHT4X \
    || CONFIG_SOFTWARE_SENSOR_BMP280 \
    || CONFIG_SOFTWARE_SENSOR_QMP6988 \
    || CONFIG_SOFTWARE_SENSOR_BME680 \
    || CONFIG_SOFTWARE_SENSOR_ADT7410 \
    || CONFIG_SOFTWARE_SENSOR_SCD30 \
    || CONFIG_SOFTWARE_SENSOR_SCD40 \
    || CONFIG_SOFTWARE_SENSOR_MHZ19C \
    || CONFIG_SOFTWARE_SENSOR_BH1750 \
    || CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT \
    || CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT \
    || CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT \
    || CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT \
    || CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT )
#include "devunit.h"
#endif

static const char *TAG = "MY-MAIN";


#if ( CONFIG_SOFTWARE_ESP_MQTT_SUPPORT || CONFIG_SOFTWARE_SENSOR_USE_SENSOR )
int8_t g_sensor_mode = 0;
float g_temperature = 0.0;
float g_humidity = 0.0;
float g_pressure = 0.0;
int g_co2 = 0;
uint16_t g_lux = 0;
uint8_t g_loopCount = 0;
#endif //CONFIG_SOFTWARE_SENSOR_USE_SENSOR

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
void RtcInterruptInit(void);
void RtcStartClockInit(void);
#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
static char g_lastSyncDatetime[72] = {0};
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
static bool g_clockout_status = false;
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

#if CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT
uint8_t g_clockCount = 0;
uint8_t g_clockCurrent = 0;
uint8_t g_clockSoundEnabled = 1;
#endif //CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT

#if CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
static int g_adc_raw;
static int g_voltage;
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle);
static void adc_calibration_deinit(adc_cali_handle_t handle);
#endif //CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT


#if CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT
TaskHandle_t xInternalButton;
Button_Internal_t* button_int1;
static void vInternal_button_task(void* pvParameters) {
    ESP_LOGD(TAG, "start INTERNAL Button");

    Button_Internal_Init();
    if (Button_Internal_Enable(BUTTON_INT1_GPIO_PIN, BUTTON_INTERNAL_ACTIVE_LOW) == ESP_OK) {
        button_int1 = Button_Internal_Attach(BUTTON_INT1_GPIO_PIN, BUTTON_INTERNAL_ACTIVE_LOW);
    }
    while(1){

        if (Button_Internal_WasPressed(button_int1)) {
            ESP_LOGI(TAG, "BUTTON INT1  PRESSED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(true);
#endif //CONFIG_SOFTWARE_UI_SUPPORT
        }
        if (Button_Internal_WasReleased(button_int1)) {
            ESP_LOGI(TAG, "BUTTON INT1 RELEASED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#endif //CONFIG_SOFTWARE_UI_SUPPORT
        }
        if (Button_Internal_WasLongPress(button_int1, pdMS_TO_TICKS(1000))) { // 1Sec
            ESP_LOGI(TAG, "BUTTON INT1 LONGPRESS!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
            ui_status_set(g_lastSyncDatetime);
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#endif //CONFIG_SOFTWARE_UI_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
            if (g_clockout_status)
            {
                g_clockout_status = 0;
            }
            else
            {
                g_clockout_status = 1;
            }
            PCF8563_ClockOutForTrimmer(g_clockout_status);
            ESP_LOGI(TAG, "PCF8563_ClockOutForTrimmer: %d", g_clockout_status);
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

        }

        vTaskDelay(pdMS_TO_TICKS(80));
    }
    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT
// SELECT GPIO_NUM_XX
TaskHandle_t xExternalButton;
Button_External_t* button_ext1;
static void vExternal_button_task(void* pvParameters) {
    ESP_LOGD(TAG, "start EXTERNAL Button");

    Button_External_Init();
    if (Button_External_Enable(BUTTON_EXT1_GPIO_PIN, BUTTON_EXTERNAL_ACTIVE_LOW) == ESP_OK) {
        button_ext1 = Button_External_Attach(BUTTON_EXT1_GPIO_PIN, BUTTON_EXTERNAL_ACTIVE_LOW);
    }
    while(1){
        if (Button_External_WasPressed(button_ext1)) {
            ESP_LOGI(TAG, "BUTTON EXT1 PRESSED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(true);
#endif
        }
        if (Button_External_WasReleased(button_ext1)) {
            ESP_LOGI(TAG, "BUTTON EXT1 RELEASED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#endif
        }
        if (Button_External_WasLongPress(button_ext1, pdMS_TO_TICKS(1000))) { // 1Sec
            ESP_LOGI(TAG, "BUTTON EXT1 LONGPRESS!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#endif
        }

        vTaskDelay(pdMS_TO_TICKS(80));
    }
    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT

