kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
#if CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
TaskHandle_t xExternalI2c;
i2c_master_bus_handle_t i2c0_master_bus_handle;
void vExternal_i2c_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL I2C");
    esp_err_t ret = ESP_OK;
    i2c_master_bus_config_t i2c_mst_config_0 = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C0_MASTER_PORT,
        .scl_io_num = I2C0_MASTER_SCL_PIN,
        .sda_io_num = I2C0_MASTER_SDA_PIN,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    ret = i2c_new_master_bus(&i2c_mst_config_0, &i2c0_master_bus_handle);
    vTaskDelay( pdMS_TO_TICKS(100) );
    if (ret == ESP_OK)
    {
        ESP_LOGD(TAG, "i2c_new_master_bus is OK.");
    }
    else
    {
        ESP_LOGE(TAG, "I2C i2c_new_master_bus error");
    }

#if CONFIG_SOFTWARE_SENSOR_ADT7410
    bool _isSensorAdt7410 = false;
    ret = Adt7410_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Adt7410_Init() is OK!");
        _isSensorAdt7410 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Adt7410_Init Error");
        g_sensor_mode -= 1;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BMP280
    bool _isSensorBmp280 = false;
    ret = Bmp280_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Bmp280_Init() is OK!");
        _isSensorBmp280 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Bmp280_Init Error");
        g_sensor_mode -= 4;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_QMP6988
    bool _isSensorQmp6988 = false;
    ret = Qmp6988_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Qmp6988_Init() is OK!");
        _isSensorQmp6988 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Qmp6988_Init Error");
        g_sensor_mode -= 4;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BME680
    bool _isSensorBme680 = false;
    ret = Esp32_Bme680_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Esp32_Bme680_Init() is OK!");
        _isSensorBme680 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Esp32_Bme680_Init Error");
        g_sensor_mode -= 7;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_SHT3X
    bool _isSensorSht3x = false;
    ret = Sht3x_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Sht3x_Init() is OK!");
        _isSensorSht3x = true;
    }
    else
    {
        ESP_LOGE(TAG, "Sht3x_Init Error");
        g_sensor_mode -= 3;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_SHT4X
    bool _isSensorSht4x = false;
    ret = Sht4x_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Sht4x_Init() is OK!");
        _isSensorSht4x = true;
    }
    else
    {
        ESP_LOGE(TAG, "Sht4x_Init Error");
        g_sensor_mode -= 3;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BH1750
    bool _isSensorBh1750 = false;
    ret = BH1750_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "BH1750_Init() is OK!");
        _isSensorBh1750 = true;

        ret = BH1750_SetMode(BH1750_CONTINUOUSLY_H_RESOLUTION_MODE);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "BH1750_SetMode Error");
        }
    }
    else
    {
        ESP_LOGE(TAG, "BH1750_Init Error");
        g_sensor_mode -= 16;
    }

#endif

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
    ret = PCF8563_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "PCF8563_Init() is OK!");

        RtcInterruptInit();
        RtcStartClockInit();
    }
    else
    {
        ESP_LOGE(TAG, "PCF8563_Init Error");
    }
#endif

    while (1) {
#if CONFIG_SOFTWARE_SENSOR_ADT7410
        if (_isSensorAdt7410) {
            g_temperature = Adt7410_getTemperature_13bit();
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_BMP280
        if (_isSensorBmp280) {
            g_pressure = Bmp280_getPressure() / 100.0;
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_QMP6988
        if (_isSensorQmp6988) {
            g_pressure = Qmp6988_CalcPressure() / 100.0;
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_BME680
        if (_isSensorBme680) {
            if (Esp32_Bme680_read_sensor_data() == 0) {
                g_temperature = Esp32_Bme680_get_temperature();
                g_humidity = Esp32_Bme680_get_humidity();
                g_pressure = Esp32_Bme680_get_pressure() / 100.0;
//                g_gas = Esp32_Bme680_get_gas() / 1000.0;
            }
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_SHT3X
        if (_isSensorSht3x) {
            ret = Sht3x_Read();
            if (ret == ESP_OK) {
                vTaskDelay( pdMS_TO_TICKS(100) );
                g_temperature = Sht3x_GetTemperature();
                g_humidity = Sht3x_GetHumidity();
            }
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_SHT4X
        if (_isSensorSht4x) {
            ret = Sht4x_Read();
            if (ret == ESP_OK) {
                vTaskDelay( pdMS_TO_TICKS(100) );
                g_temperature = Sht4x_GetTemperature();
                g_humidity = Sht4x_GetHumidity();
            }
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_BH1750
        if (_isSensorBh1750) {
            uint16_t tmp_lux = 0;
            tmp_lux = 0;
            tmp_lux = BH1750_GetLUX();
            if (tmp_lux != 0)
            {
                g_lux = tmp_lux;
            } else {
                ESP_LOGE(TAG, "BH1750_GetLUX is return lux = 0");
                vTaskDelay( pdMS_TO_TICKS(1000) );
            }
        }
#endif
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT
#if CONFIG_SOFTWARE_SENSOR_MHZ19C
bool g_mhz19cInitialized = false;
TaskHandle_t xExternalUart;
void vExternal_uart_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL UART");
    esp_err_t ret = ESP_OK;
    ret = Mhz19c_Init(UART1_PORT, UART1_TXD_PIN, UART1_RXD_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART1_RATE_BAUD);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Mhz19c_Init Error");
        g_sensor_mode -= 8;
        vTaskDelay( pdMS_TO_TICKS(500) );
        vTaskDelete(NULL);
    }
    while (!g_mhz19cInitialized)
    {
        Mhz19c_SetAutoCalibration(UART1_PORT, false);
        vTaskDelay( pdMS_TO_TICKS(5000) );

        g_co2 = Mhz19c_GetCO2Concentration(UART1_PORT);
//        if (g_co2 != 0)
        if (g_co2 >= 400)
        {
            g_mhz19cInitialized = true;
        }
        ESP_LOGE(TAG, "Mhz19c_SetAutoCalibration retry");
        Mhz19c_SetAutoCalibration(UART1_PORT, true);
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
    ESP_LOGD(TAG, "Mhz19c_Init() is OK!");

    int tmp_co2 = 0;
    while (1) {
        tmp_co2 = 0;
        tmp_co2 = Mhz19c_GetCO2Concentration(UART1_PORT);
        if (tmp_co2 != 0)
        {
            g_co2 = tmp_co2;
        } else {
            ESP_LOGE(TAG, "Mhz19c_GetCO2Concentration is return co2 = 0");
            vTaskDelay( pdMS_TO_TICKS(1000) );
        }

