kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
        if (g_loopCount == UINT8_MAX)
        {
            g_loopCount = 0;
        }
        else
        {
            g_loopCount++;
        }
        ESP_LOGD(TAG, "g_loopCount = %d. MAX = %d", g_loopCount, UINT8_MAX);

        vTaskDelay( pdMS_TO_TICKS(10000) );
    }
}
#endif //(CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
#endif //CONFIG_SOFTWARE_SENSOR_USE_SENSOR


#if CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT
TaskHandle_t xExternalLED;
Led_t* led_ext1;
static void vExternal_led_task(void* pvParameters) {
    ESP_LOGD(TAG, "start EXTERNAL LED");
    Led_Init();

    if (Led_Enable(LED_EXT1_GPIO_PIN) == ESP_OK) {
        led_ext1 = Led_Attach(LED_EXT1_GPIO_PIN);
    }
    while(1){
        Led_OnOff(led_ext1, true);
        vTaskDelay(pdMS_TO_TICKS(700));

        Led_OnOff(led_ext1, false);
        vTaskDelay(pdMS_TO_TICKS(300));
    }

    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT
TaskHandle_t xExternalRGBLedBlink;
rmt_channel_handle_t rgb_ext1_channel = NULL;
rmt_encoder_handle_t rgb_ext1_encoder = NULL;
pixel_settings_t px_ext1;

void vExternal_RGBLedBlink_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL RGBLedBlink");

    esp_err_t res = ESP_OK;
    uint8_t rgbled_count = 8;
    uint8_t blink_count = 5;
    uint32_t colors[] = {SK6812_COLOR_BLUE, SK6812_COLOR_LIME, SK6812_COLOR_AQUA
                    , SK6812_COLOR_RED, SK6812_COLOR_MAGENTA, SK6812_COLOR_YELLOW
                    , SK6812_COLOR_WHITE};

    res = Sk6812_Init_Ex(&px_ext1, rgbled_count, RGBLED_EXT1_GPIO_PIN, &rgb_ext1_channel, &rgb_ext1_encoder);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Init_Ex");
	}
    res = Sk6812_Enable_Ex(&px_ext1, rgb_ext1_channel);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Enable_Ex");
	}
    if (rgb_ext1_channel == NULL || rgb_ext1_encoder == NULL) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() NULL!");
    }
    res = Sk6812_Clear_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Clear_Ex");
	}

    while (1) {
        for (uint8_t c = 0; c < sizeof(colors)/sizeof(uint32_t); c++) {
            for (uint8_t i = 0; i < blink_count; i++) {
                Sk6812_SetAllColor_Ex(&px_ext1, colors[c]);
                Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
                vTaskDelay(pdMS_TO_TICKS(1000));

                Sk6812_SetAllColor_Ex(&px_ext1, SK6812_COLOR_OFF);
                Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT

#if CONFIG_HTTPS_OTA_SUPPORT
TaskHandle_t xHttpsOta;
/*
static void event_handler(void* arg, esp_event_base_t event_base,
                        int32_t event_id, void* event_data)
{
    if (event_base == ESP_HTTPS_OTA_EVENT) {
        switch (event_id) {
            case ESP_HTTPS_OTA_START:
                ESP_LOGI(TAG, "OTA started");
                break;
            case ESP_HTTPS_OTA_CONNECTED:
                ESP_LOGI(TAG, "Connected to server");
                break;
            case ESP_HTTPS_OTA_GET_IMG_DESC:
                ESP_LOGI(TAG, "Reading Image Description");
                break;
            case ESP_HTTPS_OTA_VERIFY_CHIP_ID:
                ESP_LOGI(TAG, "Verifying chip id of new image: %d", *(esp_chip_id_t *)event_data);
                break;
            case ESP_HTTPS_OTA_DECRYPT_CB:
                ESP_LOGI(TAG, "Callback to decrypt function");
                break;
            case ESP_HTTPS_OTA_WRITE_FLASH:
                ESP_LOGD(TAG, "Writing to flash: %d written", *(int *)event_data);
                break;
            case ESP_HTTPS_OTA_UPDATE_BOOT_PARTITION:
                ESP_LOGI(TAG, "Boot partition updated. Next Partition: %d", *(esp_partition_subtype_t *)event_data);
                break;
            case ESP_HTTPS_OTA_FINISH:
                ESP_LOGI(TAG, "OTA finish");
                break;
            case ESP_HTTPS_OTA_ABORT:
                ESP_LOGI(TAG, "OTA abort");
                break;
        }
    }
}
*/

esp_err_t do_firmware_upgrade()
{
    esp_http_client_config_t config = {
        .url = CONFIG_HTTPS_OTA_URL,
        .crt_bundle_attach = esp_crt_bundle_attach,
//        .cert_pem = (char *)server_cert_pem_start,
    };
    esp_https_ota_config_t ota_config = {
        .http_config = &config,
    };
    esp_err_t ret = esp_https_ota(&ota_config);
    if (ret == ESP_OK) {
        esp_restart();
    } else {
        return ESP_FAIL;
    }
    return ESP_OK;
}

static void vHttpsOta_task(void* pvParameters) {
    ESP_LOGI(TAG, "start HTTPS OTA");

    while(1){
        ESP_LOGI(TAG, "do_firmware_upgrade()");
        do_firmware_upgrade();
        vTaskDelay(pdMS_TO_TICKS(300000));
    }

    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_HTTPS_OTA_SUPPORT

#if CONFIG_DEEP_SLEEP_SUPPORT
#if SOC_RTC_FAST_MEM_SUPPORTED
static RTC_DATA_ATTR struct timeval sleep_enter_time;
#else
static struct timeval sleep_enter_time;
#endif

static void deep_sleep_task(void *args)
{
    /**
     * Prefer to use RTC mem instead of NVS to save the deep sleep enter time, unless the chip
     * does not support RTC mem(such as esp32c2). Because the time overhead of NVS will cause
     * the recorded deep sleep enter time to be not very accurate.
     */
#if !SOC_RTC_FAST_MEM_SUPPORTED
    // Initialize NVS
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // NVS partition was truncated and needs to be erased
        // Retry nvs_flash_init
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    nvs_handle_t nvs_handle;
    err = nvs_open("storage", NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error (%s) opening NVS handle!", esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG, "Open NVS done");
    }

