kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
    // Get deep sleep enter time
    nvs_get_i32(nvs_handle, "slp_enter_sec", (int32_t *)&sleep_enter_time.tv_sec);
    nvs_get_i32(nvs_handle, "slp_enter_usec", (int32_t *)&sleep_enter_time.tv_usec);
#endif

    struct timeval now;
    gettimeofday(&now, NULL);
    int sleep_time_ms = (now.tv_sec - sleep_enter_time.tv_sec) * 1000 + (now.tv_usec - sleep_enter_time.tv_usec) / 1000;

    switch (esp_sleep_get_wakeup_cause()) {
        case ESP_SLEEP_WAKEUP_TIMER: {
            ESP_LOGD(TAG, "Wake up from timer. Time spent in deep sleep: %dms", sleep_time_ms);
            break;
        }

#if CONFIG_DEEP_SLEEP_GPIO_WAKEUP
        case ESP_SLEEP_WAKEUP_GPIO: {
            uint64_t wakeup_pin_mask = esp_sleep_get_gpio_wakeup_status();
            if (wakeup_pin_mask != 0) {
                int pin = __builtin_ffsll(wakeup_pin_mask) - 1;
                ESP_LOGD(TAG, "Wake up from GPIO %d", pin);
            } else {
                ESP_LOGD(TAG, "Wake up from GPIO");
            }
            break;
        }
#endif //CONFIG_EXAMPLE_GPIO_WAKEUP
/*
#if CONFIG_EXAMPLE_EXT0_WAKEUP
        case ESP_SLEEP_WAKEUP_EXT0: {
            printf("Wake up from ext0\n");
            break;
        }
#endif // CONFIG_EXAMPLE_EXT0_WAKEUP

#ifdef CONFIG_EXAMPLE_EXT1_WAKEUP
        case ESP_SLEEP_WAKEUP_EXT1: {
            uint64_t wakeup_pin_mask = esp_sleep_get_ext1_wakeup_status();
            if (wakeup_pin_mask != 0) {
                int pin = __builtin_ffsll(wakeup_pin_mask) - 1;
                printf("Wake up from GPIO %d\n", pin);
            } else {
                printf("Wake up from GPIO\n");
            }
            break;
        }
#endif // CONFIG_EXAMPLE_EXT1_WAKEUP

#ifdef CONFIG_EXAMPLE_TOUCH_WAKEUP
        case ESP_SLEEP_WAKEUP_TOUCHPAD: {
            printf("Wake up from touch on pad %d\n", esp_sleep_get_touchpad_wakeup_status());
            break;
        }
#endif // CONFIG_EXAMPLE_TOUCH_WAKEUP
*/
        case ESP_SLEEP_WAKEUP_UNDEFINED:
        default:
            ESP_LOGD(TAG, "Not a deep sleep reset");
    }

//    vTaskDelay(1000 / portTICK_PERIOD_MS);
    vTaskDelay(pdMS_TO_TICKS(1000));
/*
#if CONFIG_IDF_TARGET_ESP32
    // Isolate GPIO12 pin from external circuits. This is needed for modules
    // which have an external pull-up resistor on GPIO12 (such as ESP32-WROVER)
    // to minimize current consumption.
    rtc_gpio_isolate(GPIO_NUM_12);
#endif
*/

#if CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
    while (g_loopCount < 2)
    {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    ESP_LOGD(TAG, "check g_loopCount");
#endif //CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
    ESP_LOGD(TAG, "call esp_wifi_disconnect()");
    esp_wifi_disconnect();
    ESP_LOGD(TAG, "call esp_wifi_stop()");
    esp_wifi_stop();
    ESP_LOGD(TAG, "call esp_wifi_deinit()");
    esp_wifi_deinit();
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
    vTaskDelay(pdMS_TO_TICKS(500));


    ESP_LOGI(TAG, "Entering deep sleep");

    // get deep sleep enter time
    gettimeofday(&sleep_enter_time, NULL);

#if !SOC_RTC_FAST_MEM_SUPPORTED
    // record deep sleep enter time via nvs
    ESP_ERROR_CHECK(nvs_set_i32(nvs_handle, "slp_enter_sec", sleep_enter_time.tv_sec));
    ESP_ERROR_CHECK(nvs_set_i32(nvs_handle, "slp_enter_usec", sleep_enter_time.tv_usec));
    ESP_ERROR_CHECK(nvs_commit(nvs_handle));
    nvs_close(nvs_handle);
#endif

    // enter deep sleep
    esp_deep_sleep_start();
}

#if CONFIG_DEEP_SLEEP_GPIO_WAKEUP
#define DEFAULT_WAKEUP_PIN      CONFIG_DEEP_SLEEP_GPIO_WAKEUP_PIN
#ifdef CONFIG_DEEP_SLEEP_GPIO_WAKEUP_HIGH_LEVEL
#define DEFAULT_WAKEUP_LEVEL    ESP_GPIO_WAKEUP_GPIO_HIGH
#else
#define DEFAULT_WAKEUP_LEVEL    ESP_GPIO_WAKEUP_GPIO_LOW
#endif

void deep_sleep_register_gpio_wakeup(void)
{
    const gpio_config_t config = {
        .pin_bit_mask = BIT(DEFAULT_WAKEUP_PIN),
        .mode = GPIO_MODE_INPUT,
    };

    ESP_ERROR_CHECK(gpio_config(&config));
    ESP_ERROR_CHECK(esp_deep_sleep_enable_gpio_wakeup(BIT(DEFAULT_WAKEUP_PIN), DEFAULT_WAKEUP_LEVEL));

    ESP_LOGI(TAG, "Enabling GPIO wakeup on pins GPIO%d", DEFAULT_WAKEUP_PIN);
}
#endif

#define DEFAULT_WAKEUP_TIME_SEC      CONFIG_DEEP_SLEEP_WAKEUP_TIME_SEC
static void deep_sleep_register_rtc_timer_wakeup(void)
{
    ESP_LOGI(TAG, "Enabling timer wakeup, %ds", DEFAULT_WAKEUP_TIME_SEC);
    ESP_ERROR_CHECK(esp_sleep_enable_timer_wakeup(DEFAULT_WAKEUP_TIME_SEC * 1000000));
}
#endif

#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
TaskHandle_t xDigitDisplay;
DigitDisplay_t* digitdisplay_1;
void vDigitDisplayTask(void *pvParametes)
{
    ESP_LOGI(TAG, "start Digit Display");

// Sample Rowdata
//  --0x01--
// |        |
//0x20     0x02
// |        |
//  --0x40- -
// |        |
//0x10     0x04
// |        |
//  --0x08--   0x80

// CountDown
    uint8_t listDisp_1[XDIGIT_DISPLAY_DIGIT_COUNT];
    uint8_t count = UINT8_MAX;
    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_TYPICAL, XDIGIT_DISPLAY_DIGIT_COUNT);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
        vTaskDelete(NULL);
    }
    Tm1637_ClearDisplay(digitdisplay_1);
    while(1){
        if (count == 0) {
            count = UINT8_MAX;
        }
        uint8_t digit3 = count / 100;
        uint8_t digit2 = ( count % 100 ) / 10;
        uint8_t digit1 = ( count % 10 );
        listDisp_1[0] = 0x7f; //DISPLAY_OFF
        listDisp_1[1] = 0x7f; //DISPLAY_OFF
        listDisp_1[2] = 0x7f; //DISPLAY_OFF
        listDisp_1[3] = digit3;
        listDisp_1[4] = digit2;
        listDisp_1[5] = digit1;
        Tm1637_DisplayAll(digitdisplay_1, listDisp_1);
        count--;
        vTaskDelay(pdMS_TO_TICKS(300));
    }
    vTaskDelete(NULL); // Should never get to here...

/*
    uint8_t anime[] = {0x00, 0x30, 0x38, 0x78, 0x79, 0x7f};
    uint8_t animeCurrent = 0;
    uint8_t animeMax = sizeof(anime)/sizeof(uint8_t);
    uint8_t animeDigitPosition = 1;
    uint8_t animeDigitMax = XDIGIT_DISPLAY_DIGIT_COUNT;
    uint8_t data = 0x00;

    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_TYPICAL, XDIGIT_DISPLAY_DIGIT_COUNT);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
        vTaskDelete(NULL);
        return;
    }
    while(1) {
        Tm1637_ClearDisplay(digitdisplay_1);
        vTaskDelay(pdMS_TO_TICKS(1000));
        for (animeDigitPosition = 1; animeDigitPosition < animeDigitMax+1; animeDigitPosition++) {
            for (animeCurrent = 0; animeCurrent < animeMax; animeCurrent++) {
                for (uint8_t position = DIGIT_COUNT; position > animeDigitPosition-1; position--) {
                    for (uint8_t digit = DIGIT_COUNT; digit > 0; digit--) {
                        data = 0x00;
                        if (digit == position) {
                            data += 0x80;
                        } else {
                            //data = 0x00;
                        }

