kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
                        if (digit == animeDigitPosition) {
                            data += anime[animeCurrent];
                        } else if (digit < animeDigitPosition) {
                            data = 0xff;
                        }

                        Tm1637_DisplayBitRowdata(digitdisplay_1, digit-1, data);
                    }
                    vTaskDelay(pdMS_TO_TICKS(1000));
                }
            }
        }
    }
    vTaskDelete(NULL); // Should never get to here...
*/
/*
// Sample number
    uint8_t listDisp_1[XDIGIT_DISPLAY_DIGIT_COUNT];
    uint8_t count = 0;
    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_TYPICAL, XDIGIT_DISPLAY_DIGIT_COUNT);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
        vTaskDelete(NULL);
    }
    Tm1637_ClearDisplay(digitdisplay_1);
    while(1){
        if (count == UINT8_MAX) {
            count = 0;
        }
        if (count%2) {
            for (uint8_t i = 0; i < DIGIT_COUNT; i++) {
                listDisp_1[i] = i;
            }
        } else {
            for (uint8_t i = 0; i < DIGIT_COUNT; i++) {
                listDisp_1[i] = i+4;
            }
        }
        Tm1637_DisplayAll(digitdisplay_1, listDisp_1);
        count++;
        vTaskDelay(pdMS_TO_TICKS(300));
    }
    vTaskDelete(NULL); // Should never get to here...
*/
/*
// Sample message
    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_TYPICAL, XDIGIT_DISPLAY_DIGIT_COUNT);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
        vTaskDelete(NULL);
    }
    while (1) {
        Tm1637_ClearDisplay(digitdisplay_1);
        vTaskDelay(pdMS_TO_TICKS(500));
        Tm1637_DisplayStr(digitdisplay_1, "HELL0-1234567890", 500);
        vTaskDelay(pdMS_TO_TICKS(500));
    }
    vTaskDelete(NULL); // Should never get to here...
*/
}
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT

#if CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
    // ADC
//    xTaskCreate(&vMeasureOperationVoltageTask, "vMeasureOperationVoltageTask", 4096 * 1, NULL, 2, &vMeasureOperationVoltage);
TaskHandle_t xMeasureOperationVoltage;

// ADC Calibration
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif //ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif //ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED

    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void adc_calibration_deinit(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
#endif
}

static int orignalVoltage(int vol)
{
//    return (int)(vol / 100.0 * (100.0+270.0));
    return (int)(vol / MEASURE_OPERATION_VOLTAGE_RESISTOR2 * ( MEASURE_OPERATION_VOLTAGE_RESISTOR2 + MEASURE_OPERATION_VOLTAGE_RESISTOR1 ));
}

void vMeasureOperationVoltageTask(void *pvParametes)
{
    ESP_LOGI(TAG, "start Measure Operation Voltage");
    adc_oneshot_unit_handle_t adc_handle1;
    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = MEASURE_OPERATION_VOLTAGE_UNIT,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc_handle1));

    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = MEASURE_OPERATION_VOLTAGE_ADC_ATTEN,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc_handle1, MEASURE_OPERATION_VOLTAGE_CHANNEL, &config));

    adc_cali_handle_t adc_cali_handle1 = NULL;
    bool do_calibration1 = adc_calibration_init(MEASURE_OPERATION_VOLTAGE_UNIT, MEASURE_OPERATION_VOLTAGE_CHANNEL, MEASURE_OPERATION_VOLTAGE_ADC_ATTEN, &adc_cali_handle1);

    while(1) {
        ESP_ERROR_CHECK(adc_oneshot_read(adc_handle1, MEASURE_OPERATION_VOLTAGE_CHANNEL, &g_adc_raw));
//        ESP_LOGI(TAG, "ADC%d Channel[%d] Raw Data: %d", MEASURE_OPERATION_VOLTAGE_UNIT + 1, MEASURE_OPERATION_VOLTAGE_CHANNEL, g_adc_raw);
        if (do_calibration1) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc_cali_handle1, g_adc_raw, &g_voltage));
            ESP_LOGI(TAG, "VOLTAGE ADC%d_CH%d Cali Voltage: %dmV, Operation Voltage: %dmV", MEASURE_OPERATION_VOLTAGE_UNIT + 1, MEASURE_OPERATION_VOLTAGE_CHANNEL, g_voltage, orignalVoltage(g_voltage));
        }
        vTaskDelay(pdMS_TO_TICKS(10000));
    }

    ESP_ERROR_CHECK(adc_oneshot_del_unit(adc_handle1));
    if (do_calibration1) {
        adc_calibration_deinit(adc_cali_handle1);
    }

    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT

////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
void app_main(void)
{
    ESP_LOGI(TAG, "app_main() start.");
    esp_log_level_set("*", ESP_LOG_ERROR);
    esp_log_level_set("MY-MAIN", ESP_LOG_DEBUG);
    esp_log_level_set("MY-WIFI", ESP_LOG_INFO);


#if CONFIG_SOFTWARE_UI_SUPPORT
    ui_init();
#endif //CONFIG_SOFTWARE_UI_SUPPORT

